{
"ExperienceList" : [
    {
        "role": "Software Engineer",
        "company": "Google",
        "companyLink": "https://google.com",
        "period": "2022-Present",
        "location": "Mountain View, CA",
        "description": "Worked on a team responsible for developing new features for Google's search engine, including improving the accuracy and relevance of search results and developing new tools for data analysis and visualization."
    },
    {
        "role": "Intern ",
        "company": "Facebook",
        "companyLink": "https://facebook.com",
        "period": "2021-Present",
        "location": "Menlo Park, CA",
        "description": "Worked on a team responsible for developing new features for Facebook's search engine, including improving the accuracy and relevance of search results and developing new tools for data analysis and visualization."
    },
    {
        "role": "Intern ",
        "company": "Amazon",
        "companyLink": "https://amazon.com",
        "period": "2021-Present",
        "location": "Seattle, WA",
        "description": "Worked on a team responsible for developing new features for Amazon's search engine, including improving the accuracy and relevance of search results and developing new tools for data analysis and visualization."
    },
    {
        "role": "Intern ",
        "company": "Apple",
        "companyLink": "https://apple.com",
        "period": "2021-Present",
        "location": "Cupertino, CA",
        "description": "Worked on a team responsible for developing new features for Apple's search engine, including improving the accuracy and relevance of search results and developing new tools for data analysis and visualization."
    },
    {
        "role": "Intern ",
        "company": "Microsoft",
        "companyLink": "https://microsoft.com",
        "period": "2021-Present",
        "location": "Redmond, WA",
        "description": "Worked on a team responsible for developing new features for Microsoft's search engine, including improving the accuracy and relevance of search results and developing new tools for data analysis and visualization."
    }
]
}